Alma_Tasks.org
#+TITLE: Primo Implementation - Main Task List
#+AUTHOR: etb
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/bigblow.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/hideshow.css"/>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/bigblow/js/jquery-1.11.0.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/bigblow/js/jquery-ui-1.10.2.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/bigblow/js/jquery.localscroll-min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/bigblow/js/jquery.scrollTo-1.4.3.1-min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/bigblow/js/jquery.zclip.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/bigblow/js/bigblow.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/bigblow/js/hideshow.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>

* Timeline

** Chamberlain/AdTalem Project Request Due
- Prior to 2020-09-30
** Onboarding Kickoff
- 2020-09-30
** Communication Plan Due
- 2020-10-05
** ProQuest Implementation Form Due
- 2020-10-07
** Library Team Training Start
- 2020-11-01 [Specific Date(s) TBD]
** Communication Plan Kickoff
- 2021-12-28
** Implementation Kickoff
- 2021-01-04 [Specific Date(s) TBD]
** Test Load Start
- 2021-01-26
** Cutover Start
- 2021-04-18
** Implementation Complete
- 2021-05-04
** Public Alpha Test
- 2021-05-05 through 2021-05-31
** Public Beta Test
- 2021-06-01 through 2021-06-30
** Training Workshops
- 2021-06-01 through 2021-06-30
** Go Live Date
- 2021-07-01

* Library Team Tasks

** Acquisitions - Vendor Information

*** TODO Validate all vendor contact/payment information

- Vendor Rep (including email and phone)
- Account Number/Identifier
- Billing address
- Account Support Contact (if different from rep)
- Technical Support Contact (if different from rep)

*** TODO Review Chamberlain University Library contact/payment information with all vendors

- Confirm that Rachel Hanses (or Eric Bemiller) is listed as the CU Library Contact Person
- Remove all references to "DeVry Group," "Chamberlain College of Nursing," and "DVG"; replace with Chamberlain University or Adtalem as appropriate

** Aquisitons - Invoicing and Purchase Orders

*** TODO Collect and organize copies of all vendor invoices from July 2019 to present
*** TODO Collect and organize copies of all library purchase orders from July 2019 to present

** Aquisitions - Usage Reports

*** TODO Create reference sheet identifying which system each vendor uses to report usage (Counter4/Counter5/Vendor-Specific, etc.)
*** TODO Obtain and store all usage reports

- Full reports for all vendors from July 2019 to present
- As many historical reports as are still available, as far back as possible

** Digital/E-Resources

*** TODO Create reference workbook for each subscription package, including:

- Package Name
- Vendor Name
- Package URL
- Title List and Coverage(s)
- Subscription Dates (Start/End)
- Subscription Price
- Patron Authentication (EZProxy, Vendor-Specific, etc.)
- Administrative URL
- Administrative Authentication Information (IP, Username, None, etc.)
- Copyright and Usage Considerations, if any

*** TODO Create reference workbook for each Open Access package, including:

- Package Name
- Vendor Name
- Package URL
- Title List and Coverage(s)
- Patron Authentication (EZProxy, Vendor-Specific, etc.)
- Administrative URL (if any)
- Administrative Authentication Information (if any)
- Copyright and Usage Considerations

*** TODO Create reference sheet identifying "High Priority" resources, such as:

- Readings from library resources referenced directly in courses (ebook chapters, articles, etc.)
- Core/Most Important Databases

*** TODO Create reference sheet identiying "Low Priority" resources, such as:

- Subscription packages that are expiring or planned for discontinuation
- Reference-only collections/packages

*** TODO Weeding Project for Ebsco Perpetual Titles

- Identify all titles with usage in the prior year
- Apply weeding criteria to titles with usage
- Generate list of titles to bring forward into Alma
- Generate list of titles to exclude from Alma (weeded titles, including zero-usage titles)
- Generate list of titles with newer editions to be purchase

** Fulfillment

*** DONE None, as we do not have phyiscal collections

** Interlibrary Loan

*** TODO Task list and extent of integration not currently clear, follow up after 9/30 meeting

** Discovery

*** TODO Review Metadata Definitions (after 9/30 meeting)

*** TODO Determine "tuning" parameters for discovery interface

*** TODO Conform discovery interface to Chamberlain Branding

*** TODO Develop UX/UI huidelines for discovery interface and apply

*** TODO Develop accessibility guidelines for discovery interface and apply

*** TODO Identify packages/resources that do not work effectively in the discovery interface

*** TODO Develop plan to mitigate discovery gaps
* Chamberlain IT Tasks

** Basic Infrastructure

*** TODO Create SFTP Server for file transfers

** User Management Integrations (Mandatory)

*** TODO Implement Connection with Student Information System

*** TODO Implement connection with Authentication/SSO System (Current: Okta; Future: Azure)

** Acquisitions Integrations (If Possible)

*** TODO Implement payment workflow to automate invoice movement and payment confirmations between Alma and AP Advantage

*** TODO Implement Purchase Order workflow between Alma and Lawson
