Alma_Tasks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-31 Mon 12:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Primo Implementation - Main Task List</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="etb" />

<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/hideshow.css"/>









</head>
<body>
<div id="content">
<h1 class="title">Primo Implementation - Main Task List</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc1e8bd2">Timeline</a>
<ul>
<li><a href="#org23f40d7">Prior to 2020-09-30</a></li>
<li><a href="#orgeb42323">2020-09-30</a></li>
<li><a href="#org956240e">2020-10-05</a></li>
<li><a href="#org9efbd7b">2020-10-07</a></li>
<li><a href="#org11d5fd3">2020-11-01 [Specific Date(s) TBD]</a></li>
<li><a href="#org3b672da">2021-12-28</a></li>
<li><a href="#org54ef50a">2021-01-04 [Specific Date(s) TBD]</a></li>
<li><a href="#orgad90ee6">2021-01-26</a></li>
<li><a href="#org2779714">2021-04-18</a></li>
<li><a href="#org913409d">2021-05-04</a></li>
<li><a href="#orgc91ed98">2021-05-05 through 2021-05-31</a></li>
<li><a href="#orgd1cb804">2021-06-01 through 2021-06-30</a></li>
<li><a href="#org4781e92">2021-07-01</a></li>
</ul>
</li>
<li><a href="#orgf530275">Library Team Tasks</a>
<ul>
<li><a href="#org7d1a2ce">Acquisitions - Vendor Information</a>
<ul>
<li><a href="#org5e4bf10"><span class="todo TODO">TODO</span> Validate all vendor contact/payment information</a></li>
<li><a href="#org96b2b15"><span class="todo TODO">TODO</span> Review Chamberlain University Library contact/payment information with all vendors</a></li>
</ul>
</li>
<li><a href="#orga46c498">Aquisitons - Invoicing and Purchase Orders</a>
<ul>
<li><a href="#orge061a93"><span class="todo TODO">TODO</span> Collect and organize copies of all vendor invoices from July 2019 to present</a></li>
<li><a href="#orgd12ac91"><span class="todo TODO">TODO</span> Collect and organize copies of all library purchase orders from July 2019 to present</a></li>
</ul>
</li>
<li><a href="#org19e8ee3">Aquisitions - Usage Reports</a>
<ul>
<li><a href="#org8e66e13"><span class="todo TODO">TODO</span> Create reference sheet identifying which system each vendor uses to report usage (Counter4/Counter5/Vendor-Specific, etc.)</a></li>
<li><a href="#org3ea0675"><span class="todo TODO">TODO</span> Obtain and store all usage reports</a></li>
</ul>
</li>
<li><a href="#org4e7c092">Digital/E-Resources</a>
<ul>
<li><a href="#org4a3d634"><span class="todo TODO">TODO</span> Create reference workbook for each subscription package, including:</a></li>
<li><a href="#org2a93693"><span class="todo TODO">TODO</span> Create reference workbook for each Open Access package, including:</a></li>
<li><a href="#orgc367531"><span class="todo TODO">TODO</span> Create reference sheet identifying "High Priority" resources, such as:</a></li>
<li><a href="#org67e5aa0"><span class="todo TODO">TODO</span> Create reference sheet identiying "Low Priority" resources, such as:</a></li>
<li><a href="#org906e361"><span class="todo TODO">TODO</span> Weeding Project for Ebsco Perpetual Titles</a></li>
</ul>
</li>
<li><a href="#org736b83d">Fulfillment</a>
<ul>
<li><a href="#org1c9c309"><span class="done DONE">DONE</span> None, as we do not have phyiscal collections</a></li>
</ul>
</li>
<li><a href="#org50c7c5f">Interlibrary Loan</a>
<ul>
<li><a href="#org9f0d3d4"><span class="todo TODO">TODO</span> Task list and extent of integration not currently clear, follow up after 9/30 meeting</a></li>
</ul>
</li>
<li><a href="#org258fb08">Discovery</a>
<ul>
<li><a href="#org8911639"><span class="todo TODO">TODO</span> Review Metadata Definitions (after 9/30 meeting)</a></li>
<li><a href="#org329c8e9"><span class="todo TODO">TODO</span> Determine "tuning" parameters for discovery interface</a></li>
<li><a href="#org3e41da3"><span class="todo TODO">TODO</span> Conform discovery interface to Chamberlain Branding</a></li>
<li><a href="#org14699ea"><span class="todo TODO">TODO</span> Develop UX/UI huidelines for discovery interface and apply</a></li>
<li><a href="#org0b912bc"><span class="todo TODO">TODO</span> Develop accessibility guidelines for discovery interface and apply</a></li>
<li><a href="#org9f73374"><span class="todo TODO">TODO</span> Identify packages/resources that do not work effectively in the discovery interface</a></li>
<li><a href="#orgbf94790"><span class="todo TODO">TODO</span> Develop plan to mitigate discovery gaps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb82a26c">Chamberlain IT Tasks</a>
<ul>
<li><a href="#org2020e05">Basic Infrastructure</a>
<ul>
<li><a href="#orgab71d3f"><span class="todo TODO">TODO</span> Create SFTP Server for file transfers</a></li>
</ul>
</li>
<li><a href="#org22118d2">User Management Integrations (Mandatory)</a>
<ul>
<li><a href="#orge3e5913"><span class="todo TODO">TODO</span> Implement Connection with Student Information System</a></li>
<li><a href="#orgf73bc75"><span class="todo TODO">TODO</span> Implement connection with Authentication/SSO System (Current: Okta; Future: Azure)</a></li>
</ul>
</li>
<li><a href="#org01d191e">Acquisitions Integrations (If Possible)</a>
<ul>
<li><a href="#orgec63348"><span class="todo TODO">TODO</span> Implement payment workflow to automate invoice movement and payment confirmations between Alma and AP Advantage</a></li>
<li><a href="#orgcabb11b"><span class="todo TODO">TODO</span> Implement Purchase Order workflow between Alma and Lawson</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc1e8bd2" class="outline-2">
<h2 id="orgc1e8bd2">Timeline</h2>
<div class="outline-text-2" id="text-orgc1e8bd2">
</div>
<div id="outline-container-org23f40d7" class="outline-3">
<h3 id="org23f40d7">Prior to 2020-09-30</h3>
<div class="outline-text-3" id="text-org23f40d7">
<ul class="org-ul">
<li>Chamberlain/AdTalem IT Project Request Due</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb42323" class="outline-3">
<h3 id="orgeb42323">2020-09-30</h3>
<div class="outline-text-3" id="text-orgeb42323">
<ul class="org-ul">
<li>Onboarding Kickoff</li>
</ul>
</div>
</div>
<div id="outline-container-org956240e" class="outline-3">
<h3 id="org956240e">2020-10-05</h3>
<div class="outline-text-3" id="text-org956240e">
<ul class="org-ul">
<li>Communication Plan Due</li>
</ul>
</div>
</div>
<div id="outline-container-org9efbd7b" class="outline-3">
<h3 id="org9efbd7b">2020-10-07</h3>
<div class="outline-text-3" id="text-org9efbd7b">
<ul class="org-ul">
<li>ProQuest Implementation Form Due</li>
</ul>
</div>
</div>
<div id="outline-container-org11d5fd3" class="outline-3">
<h3 id="org11d5fd3">2020-11-01 [Specific Date(s) TBD]</h3>
<div class="outline-text-3" id="text-org11d5fd3">
<ul class="org-ul">
<li>Library Team Training Start</li>
</ul>
</div>
</div>
<div id="outline-container-org3b672da" class="outline-3">
<h3 id="org3b672da">2021-12-28</h3>
<div class="outline-text-3" id="text-org3b672da">
<ul class="org-ul">
<li>Communication Plan Kickoff</li>
</ul>
</div>
</div>
<div id="outline-container-org54ef50a" class="outline-3">
<h3 id="org54ef50a">2021-01-04 [Specific Date(s) TBD]</h3>
<div class="outline-text-3" id="text-org54ef50a">
<ul class="org-ul">
<li>Implementation Kickoff</li>
</ul>
</div>
</div>
<div id="outline-container-orgad90ee6" class="outline-3">
<h3 id="orgad90ee6">2021-01-26</h3>
<div class="outline-text-3" id="text-orgad90ee6">
<ul class="org-ul">
<li>Test Load Start</li>
</ul>
</div>
</div>
<div id="outline-container-org2779714" class="outline-3">
<h3 id="org2779714">2021-04-18</h3>
<div class="outline-text-3" id="text-org2779714">
<ul class="org-ul">
<li>Cutover Start</li>
</ul>
</div>
</div>
<div id="outline-container-org913409d" class="outline-3">
<h3 id="org913409d">2021-05-04</h3>
<div class="outline-text-3" id="text-org913409d">
<ul class="org-ul">
<li>Implementation Complete</li>
</ul>
</div>
</div>
<div id="outline-container-orgc91ed98" class="outline-3">
<h3 id="orgc91ed98">2021-05-05 through 2021-05-31</h3>
<div class="outline-text-3" id="text-orgc91ed98">
<ul class="org-ul">
<li>Public Alpha Test</li>
</ul>
</div>
</div>
<div id="outline-container-orgd1cb804" class="outline-3">
<h3 id="orgd1cb804">2021-06-01 through 2021-06-30</h3>
<div class="outline-text-3" id="text-orgd1cb804">
<ul class="org-ul">
<li>Public Beta Test</li>
<li>Training Workshops</li>
</ul>
</div>
</div>
<div id="outline-container-org4781e92" class="outline-3">
<h3 id="org4781e92">2021-07-01</h3>
<div class="outline-text-3" id="text-org4781e92">
<ul class="org-ul">
<li>Go Live Date</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf530275" class="outline-2">
<h2 id="orgf530275">Library Team Tasks</h2>
<div class="outline-text-2" id="text-orgf530275">
</div>
<div id="outline-container-org7d1a2ce" class="outline-3">
<h3 id="org7d1a2ce">Acquisitions - Vendor Information</h3>
<div class="outline-text-3" id="text-org7d1a2ce">
</div>
<div id="outline-container-org5e4bf10" class="outline-4">
<h4 id="org5e4bf10"><span class="todo TODO">TODO</span> Validate all vendor contact/payment information</h4>
<div class="outline-text-4" id="text-org5e4bf10">
<ul class="org-ul">
<li>Vendor Rep (including email and phone)</li>
<li>Account Number/Identifier</li>
<li>Billing address</li>
<li>Account Support Contact (if different from rep)</li>
<li>Technical Support Contact (if different from rep)</li>
</ul>
</div>
</div>

<div id="outline-container-org96b2b15" class="outline-4">
<h4 id="org96b2b15"><span class="todo TODO">TODO</span> Review Chamberlain University Library contact/payment information with all vendors</h4>
<div class="outline-text-4" id="text-org96b2b15">
<ul class="org-ul">
<li>Confirm that Rachel Hanses (or Eric Bemiller) is listed as the CU Library Contact Person</li>
<li>Remove all references to "DeVry Group," "Chamberlain College of Nursing," and "DVG"; replace with Chamberlain University or Adtalem as appropriate</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga46c498" class="outline-3">
<h3 id="orga46c498">Aquisitons - Invoicing and Purchase Orders</h3>
<div class="outline-text-3" id="text-orga46c498">
</div>
<div id="outline-container-orge061a93" class="outline-4">
<h4 id="orge061a93"><span class="todo TODO">TODO</span> Collect and organize copies of all vendor invoices from July 2019 to present</h4>
</div>
<div id="outline-container-orgd12ac91" class="outline-4">
<h4 id="orgd12ac91"><span class="todo TODO">TODO</span> Collect and organize copies of all library purchase orders from July 2019 to present</h4>
</div>
</div>

<div id="outline-container-org19e8ee3" class="outline-3">
<h3 id="org19e8ee3">Aquisitions - Usage Reports</h3>
<div class="outline-text-3" id="text-org19e8ee3">
</div>
<div id="outline-container-org8e66e13" class="outline-4">
<h4 id="org8e66e13"><span class="todo TODO">TODO</span> Create reference sheet identifying which system each vendor uses to report usage (Counter4/Counter5/Vendor-Specific, etc.)</h4>
</div>
<div id="outline-container-org3ea0675" class="outline-4">
<h4 id="org3ea0675"><span class="todo TODO">TODO</span> Obtain and store all usage reports</h4>
<div class="outline-text-4" id="text-org3ea0675">
<ul class="org-ul">
<li>Full reports for all vendors from July 2019 to present</li>
<li>As many historical reports as are still available, as far back as possible</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4e7c092" class="outline-3">
<h3 id="org4e7c092">Digital/E-Resources</h3>
<div class="outline-text-3" id="text-org4e7c092">
</div>
<div id="outline-container-org4a3d634" class="outline-4">
<h4 id="org4a3d634"><span class="todo TODO">TODO</span> Create reference workbook for each subscription package, including:</h4>
<div class="outline-text-4" id="text-org4a3d634">
<ul class="org-ul">
<li>Package Name</li>
<li>Vendor Name</li>
<li>Package URL</li>
<li>Title List and Coverage(s)</li>
<li>Subscription Dates (Start/End)</li>
<li>Subscription Price</li>
<li>Patron Authentication (EZProxy, Vendor-Specific, etc.)</li>
<li>Administrative URL</li>
<li>Administrative Authentication Information (IP, Username, None, etc.)</li>
<li>Copyright and Usage Considerations, if any</li>
</ul>
</div>
</div>

<div id="outline-container-org2a93693" class="outline-4">
<h4 id="org2a93693"><span class="todo TODO">TODO</span> Create reference workbook for each Open Access package, including:</h4>
<div class="outline-text-4" id="text-org2a93693">
<ul class="org-ul">
<li>Package Name</li>
<li>Vendor Name</li>
<li>Package URL</li>
<li>Title List and Coverage(s)</li>
<li>Patron Authentication (EZProxy, Vendor-Specific, etc.)</li>
<li>Administrative URL (if any)</li>
<li>Administrative Authentication Information (if any)</li>
<li>Copyright and Usage Considerations</li>
</ul>
</div>
</div>

<div id="outline-container-orgc367531" class="outline-4">
<h4 id="orgc367531"><span class="todo TODO">TODO</span> Create reference sheet identifying "High Priority" resources, such as:</h4>
<div class="outline-text-4" id="text-orgc367531">
<ul class="org-ul">
<li>Readings from library resources referenced directly in courses (ebook chapters, articles, etc.)</li>
<li>Core/Most Important Databases</li>
</ul>
</div>
</div>

<div id="outline-container-org67e5aa0" class="outline-4">
<h4 id="org67e5aa0"><span class="todo TODO">TODO</span> Create reference sheet identiying "Low Priority" resources, such as:</h4>
<div class="outline-text-4" id="text-org67e5aa0">
<ul class="org-ul">
<li>Subscription packages that are expiring or planned for discontinuation</li>
<li>Reference-only collections/packages</li>
</ul>
</div>
</div>

<div id="outline-container-org906e361" class="outline-4">
<h4 id="org906e361"><span class="todo TODO">TODO</span> Weeding Project for Ebsco Perpetual Titles</h4>
<div class="outline-text-4" id="text-org906e361">
<ul class="org-ul">
<li>Identify all titles with usage in the prior year</li>
<li>Apply weeding criteria to titles with usage</li>
<li>Generate list of titles to bring forward into Alma</li>
<li>Generate list of titles to exclude from Alma (weeded titles, including zero-usage titles)</li>
<li>Generate list of titles with newer editions to be purchase</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org736b83d" class="outline-3">
<h3 id="org736b83d">Fulfillment</h3>
<div class="outline-text-3" id="text-org736b83d">
</div>
<div id="outline-container-org1c9c309" class="outline-4">
<h4 id="org1c9c309"><span class="done DONE">DONE</span> None, as we do not have phyiscal collections</h4>
</div>
</div>

<div id="outline-container-org50c7c5f" class="outline-3">
<h3 id="org50c7c5f">Interlibrary Loan</h3>
<div class="outline-text-3" id="text-org50c7c5f">
</div>
<div id="outline-container-org9f0d3d4" class="outline-4">
<h4 id="org9f0d3d4"><span class="todo TODO">TODO</span> Task list and extent of integration not currently clear, follow up after 9/30 meeting</h4>
</div>
</div>

<div id="outline-container-org258fb08" class="outline-3">
<h3 id="org258fb08">Discovery</h3>
<div class="outline-text-3" id="text-org258fb08">
</div>
<div id="outline-container-org8911639" class="outline-4">
<h4 id="org8911639"><span class="todo TODO">TODO</span> Review Metadata Definitions (after 9/30 meeting)</h4>
</div>

<div id="outline-container-org329c8e9" class="outline-4">
<h4 id="org329c8e9"><span class="todo TODO">TODO</span> Determine "tuning" parameters for discovery interface</h4>
</div>

<div id="outline-container-org3e41da3" class="outline-4">
<h4 id="org3e41da3"><span class="todo TODO">TODO</span> Conform discovery interface to Chamberlain Branding</h4>
</div>

<div id="outline-container-org14699ea" class="outline-4">
<h4 id="org14699ea"><span class="todo TODO">TODO</span> Develop UX/UI huidelines for discovery interface and apply</h4>
</div>

<div id="outline-container-org0b912bc" class="outline-4">
<h4 id="org0b912bc"><span class="todo TODO">TODO</span> Develop accessibility guidelines for discovery interface and apply</h4>
</div>

<div id="outline-container-org9f73374" class="outline-4">
<h4 id="org9f73374"><span class="todo TODO">TODO</span> Identify packages/resources that do not work effectively in the discovery interface</h4>
</div>

<div id="outline-container-orgbf94790" class="outline-4">
<h4 id="orgbf94790"><span class="todo TODO">TODO</span> Develop plan to mitigate discovery gaps</h4>
</div>
</div>
</div>
<div id="outline-container-orgb82a26c" class="outline-2">
<h2 id="orgb82a26c">Chamberlain IT Tasks</h2>
<div class="outline-text-2" id="text-orgb82a26c">
</div>
<div id="outline-container-org2020e05" class="outline-3">
<h3 id="org2020e05">Basic Infrastructure</h3>
<div class="outline-text-3" id="text-org2020e05">
</div>
<div id="outline-container-orgab71d3f" class="outline-4">
<h4 id="orgab71d3f"><span class="todo TODO">TODO</span> Create SFTP Server for file transfers</h4>
</div>
</div>

<div id="outline-container-org22118d2" class="outline-3">
<h3 id="org22118d2">User Management Integrations (Mandatory)</h3>
<div class="outline-text-3" id="text-org22118d2">
</div>
<div id="outline-container-orge3e5913" class="outline-4">
<h4 id="orge3e5913"><span class="todo TODO">TODO</span> Implement Connection with Student Information System</h4>
</div>

<div id="outline-container-orgf73bc75" class="outline-4">
<h4 id="orgf73bc75"><span class="todo TODO">TODO</span> Implement connection with Authentication/SSO System (Current: Okta; Future: Azure)</h4>
</div>
</div>

<div id="outline-container-org01d191e" class="outline-3">
<h3 id="org01d191e">Acquisitions Integrations (If Possible)</h3>
<div class="outline-text-3" id="text-org01d191e">
</div>
<div id="outline-container-orgec63348" class="outline-4">
<h4 id="orgec63348"><span class="todo TODO">TODO</span> Implement payment workflow to automate invoice movement and payment confirmations between Alma and AP Advantage</h4>
</div>

<div id="outline-container-orgcabb11b" class="outline-4">
<h4 id="orgcabb11b"><span class="todo TODO">TODO</span> Implement Purchase Order workflow between Alma and Lawson</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: etb</p>
<p class="date">Created: 2020-08-31 Mon 12:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
